<a href="https://colab.research.google.com/github/ejrtks1020/Bigdata_Analysis_Certification/blob/main/%EB%B9%85%EB%B6%84%EA%B8%B0__T1_11_min_max_%EA%B8%B0%EC%A4%80_%EC%83%81%ED%95%98%EC%9C%84_5_%EA%B0%92.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# min-max스케일링 기준 상하위 5% 구하기
* 주어진 데이터에서 'f5'컬럼을 min-max 스케일 변환한 후, 상위 5%와 하위 5% 값의 합을 구하시오

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.read_csv('basic1.csv')

In [ ]:
df['f5'].describe()

count    100.000000
mean      56.734537
std       28.454244
min        9.796378
25%       29.269869
50%       64.113099
75%       81.025055
max       98.429899
Name: f5, dtype: float64

* 방법 1 : 라이브러리 이용

In [ ]:
from sklearn.preprocessing import MinMaxScaler

scale = MinMaxScaler()

df['f5'] = scale.fit_transform(df[['f5']])

In [ ]:
df['f5'].describe()

count    100.000000
mean       0.529576
std        0.321033
min        0.000000
25%        0.219708
50%        0.612824
75%        0.803631
max        1.000000
Name: f5, dtype: float64

In [ ]:
np.percentile(df['f5'], 95) + np.percentile(df['f5'], 5) # 상위 5퍼센트, 하위 5퍼센트

1.0248740983597389

* 방법 2 : lambda 함수 이용

In [ ]:
df = pd.read_csv('basic1.csv')

In [ ]:
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [ ]:
df['f5-1'] = df['f5'].apply(lambda x : (x - np.min(df['f5'])) / (np.max(df['f5'] - np.min(df['f5']))))

In [ ]:
df['f5-1'].describe()

count    100.000000
mean       0.529576
std        0.321033
min        0.000000
25%        0.219708
50%        0.612824
75%        0.803631
max        1.000000
Name: f5-1, dtype: float64

In [ ]:
df.head()

     id   age city    f1  f2   f3    f4         f5      f5-1
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791  0.919533
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826  0.570252
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986  0.084129
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078  0.483685
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869  0.219708

In [ ]:
df['f5-2'] = df['f5'].transform(lambda x: ((x - x.min()) / (x.max() - x.min() ) ))

In [ ]:
df.head()

     id   age city    f1  f2   f3    f4         f5      f5-1      f5-2
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791  0.919533  0.919533
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826  0.570252  0.570252
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986  0.084129  0.084129
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078  0.483685  0.483685
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869  0.219708  0.219708

In [ ]:
# 4 분위수 구하기
upper = df['f5-1'].quantile(0.95) # 상위 5 퍼센트
lower = df['f5-1'].quantile(0.05) # 하위 5 퍼센트
print(upper + lower)

1.0248740983597389